{
    "projects" : [
        {

            "title": "E-commerce App",
            "bodyText": "- Designed and implemented RESTful APIs for product management, user authentication, and order processing, enabling seamless interaction between the frontend and backend.\n - Integrated payment gateway APIs for secure transaction processing, reducing payment failures by 15%.\n- Implemented database indexing and optimized SQL queries, resulting in a 20% reduction in page load times.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/chiragS02/E-commerce-App.git"
                }

            ],
            "tags" : [
                "Java",
                "Spring Boot",
                "ReactJS",
                "RESTful APIs"

            ]
        },
        {

            "title": "Sentiment Analysis of Tweets",
            "bodyText": "- Implemented sentiment analysis algorithms using scikit-learn to classify tweets into positive, negative, and neutral sentiments.\n- Preprocessed large datasets of tweets, including text cleaning, tokenization, and removal of stop words, improving model accuracy by 10%.\n- Developed a visualization dashboard using Matplotlib and Seaborn to display sentiment trends over time, allowing users to analyze sentiment shifts.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/chiragS02/Sentiment-Analysis-of-tweets.git"
                }
            ],
            "tags" : [
                "Python",
                "Natural Language Processing (NLP)",
                "Pandas",
                "Jupyter Notebook"
            ]
        },
        {

            "title": "Bengaluru Metro Application",
            "bodyText": "- Developed an efficient route planning algorithm using graph data structures, allowing users to find the shortest path between metro stations.\n- Implemented data structures like queues and trees for managing metro station data and route information, optimizing search operations.\n- Built a custom file handling system to store and retrieve metro schedules, station details, and user preferences, ensuring data persistence across sessions.\n- Designed a simple command-line interface for user interactions, making it easy for users to query route information and station details.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/chiragS02/Bengaluru-Metro-Application.git"
                }
            ],
            "tags" : [
                "Java",
                "Data Structures",
                "Algorithms"
            ]
        },
        {
            "title": "Two-way Sign Language Translation",
            "bodyText": "- Developed a deep learning model using TensorFlow and Keras for recognizing and translating sign language gestures into text and speech.\n- Implemented OpenCV for real-time video capture and image processing, enabling smooth gesture recognition.\n- Trained the model on a custom dataset of hand gestures, achieving a recognition accuracy of 90% for commonly used signs.\n- Built a user-friendly interface using PyQt for non-sign language users to communicate seamlessly with sign language users.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/chiragS02/Two_way_sign_language_translation.git"
                }
            ],
            "tags" : [
                "Python",
                "TensorFlow",
                "Deep Learning",
                "OpenCV"
            ]
        }

    ]
}